#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```terraform
module.ecr-app.aws_ecr_repository.main: Refreshing state... [id=line-bot-sample2-app]
module.ecs.aws_ecs_cluster.main: Refreshing state... [id=arn:aws:ecs:ap-northeast-1:554506578892:cluster/line-bot-sample2]
module.rds.aws_ssm_parameter.database_password_secret: Refreshing state... [id=MYSQL_PASSWORD]
module.vpc.aws_vpc.main: Refreshing state... [id=vpc-0b9c9dcab97f3491c]
module.ecs.aws_cloudwatch_log_group.line-bot-sample2: Refreshing state... [id=/aws/ecs/line-bot-sample2]
module.rds.aws_rds_cluster_parameter_group.this: Refreshing state... [id=linebot-sample2-rds-mysql]
module.rds.aws_eip.nat_1a: Refreshing state... [id=eipalloc-09c67e2785bb869ee]
module.rds.aws_eip.nat: Refreshing state... [id=eipalloc-02cd8748a3f45108c]
module.rds.aws_vpc.debug: Refreshing state... [id=vpc-057baf88858bb1f4e]
module.rds.aws_key_pair.mmm2: Refreshing state... [id=mmm2]
module.route53.aws_acm_certificate.main: Refreshing state... [id=arn:aws:acm:ap-northeast-1:554506578892:certificate/06e7b54e-fc23-4c2b-8939-aabde5bbb683]
module.ecs.aws_iam_role.ecs_task_execution_role: Refreshing state... [id=EcsTaskRole-line-bot-sample2]
module.ecs.aws_iam_role_policy_attachment.ecs_task_execution_role_policy_for_ecr: Refreshing state... [id=EcsTaskRole-line-bot-sample2-20210429021106029600000001]
module.ecs.aws_iam_role_policy.cloudwatch_logs: Refreshing state... [id=EcsTaskRole-line-bot-sample2:cloudwatch_logs]
module.rds.aws_iam_role_policy.mysql_db_password_policy_secretsmanager: Refreshing state... [id=EcsTaskRole-line-bot-sample2:password-policy-mysql_db_password_policy_secretsmanager]
module.route53.aws_route53_record.validations["line-bot-sample2.moikilo00.net"]: Refreshing state... [id=Z04052072YGY8CIREK2A2__9423f2f8b78ae3bdeb3548f1bea69efa.line-bot-sample2.moikilo00.net._CNAME]
module.route53.aws_acm_certificate_validation.main: Refreshing state... [id=2021-04-27 09:08:01 +0000 UTC]
module.vpc.aws_subnet.publics[0]: Refreshing state... [id=subnet-0bb63a2f82ac5687b]
module.vpc.aws_subnet.privates[1]: Refreshing state... [id=subnet-071a11b51c485b0b1]
module.vpc.aws_subnet.publics[1]: Refreshing state... [id=subnet-0a3c585bbf6bba58b]
module.vpc.aws_route_table.privates[1]: Refreshing state... [id=rtb-0a31ed301afa10c9e]
module.vpc.aws_subnet.privates[0]: Refreshing state... [id=subnet-0d00944d99dfe3fb9]
module.vpc.aws_subnet.privates[2]: Refreshing state... [id=subnet-02c271aaae088ea4b]
module.ecr-app.aws_vpc_endpoint.s3: Refreshing state... [id=vpce-05f06bcd8be5135ea]
module.vpc.aws_route_table.privates[2]: Refreshing state... [id=rtb-0f70a7f400318b4fa]
module.vpc.aws_subnet.publics[2]: Refreshing state... [id=subnet-03c288199d18a8e45]
module.vpc.aws_route_table.privates[0]: Refreshing state... [id=rtb-0b7249501f7f39f80]
module.ecr-app.aws_security_group.vpc_endpoint: Refreshing state... [id=sg-096192166d6f9cd8b]
module.vpc.aws_internet_gateway.main: Refreshing state... [id=igw-0db9d7fef1d452a9f]
module.vpc.aws_route_table.public: Refreshing state... [id=rtb-0833e5cbb3feed7c4]
module.alb.aws_security_group.alb: Refreshing state... [id=sg-0829c8222f3c2e3f0]
module.alb.aws_lb_target_group.main: Refreshing state... [id=arn:aws:elasticloadbalancing:ap-northeast-1:554506578892:targetgroup/line-bot-sample2-target-group/85c2e8b8911549f7]
module.rds.aws_security_group.mysql_to_private: Refreshing state... [id=sg-0200472868087adb3]
module.rds.aws_security_group.ec2_private_nat_to_global: Refreshing state... [id=sg-0d5ed516513b6a83c]
module.ecs.aws_security_group.ecs: Refreshing state... [id=sg-071dd337cfbbbb50d]
module.rds.aws_security_group.example: Refreshing state... [id=sg-06bdc7be2c94a7cf0]
module.rds.aws_security_group.vpc_endpoint_rds: Refreshing state... [id=sg-0ce678efdd64b44e5]
module.rds.aws_security_group.this: Refreshing state... [id=sg-08ac515ab6e8ebdf7]
module.rds.aws_security_group.ec2_private: Refreshing state... [id=sg-086f3ab5fea1aa2b9]
module.rds.aws_security_group.ec2_public_bastian: Refreshing state... [id=sg-0ca95d51ffe6d8894]
module.rds.aws_route_table.private_1a: Refreshing state... [id=rtb-01d8342ff72d3f71b]
module.rds.aws_subnet.debug_private_1a: Refreshing state... [id=subnet-03be988dfa3dccff4]
module.rds.aws_security_group.main: Refreshing state... [id=sg-09d1e9fd454bc518a]
module.rds.aws_route_table.public: Refreshing state... [id=rtb-03ce25fc83446e2b6]
module.rds.aws_internet_gateway.debug-ec2-main: Refreshing state... [id=igw-0eea30ac93e0f6a72]
module.rds.aws_subnet.debug_public_1a: Refreshing state... [id=subnet-0a51bbdae1065c9c6]
module.vpc.aws_route_table_association.privates[2]: Refreshing state... [id=rtbassoc-0c7b9baba708642b6]
module.vpc.aws_route_table_association.privates[0]: Refreshing state... [id=rtbassoc-0840d58339cd83f90]
module.vpc.aws_route_table_association.privates[1]: Refreshing state... [id=rtbassoc-0a74d87da37cd4c32]
module.vpc.aws_route_table_association.public[1]: Refreshing state... [id=rtbassoc-0dfdb12fab7d4006a]
module.vpc.aws_route_table_association.public[0]: Refreshing state... [id=rtbassoc-05e859eb1301e09d1]
module.vpc.aws_route.public: Refreshing state... [id=r-rtb-0833e5cbb3feed7c41080289494]
module.rds.aws_security_group_rule.out_all: Refreshing state... [id=sgrule-3986439656]
module.vpc.aws_route_table_association.public[2]: Refreshing state... [id=rtbassoc-0f51279304586a58e]
module.rds.aws_security_group_rule.in_icmp: Refreshing state... [id=sgrule-4046640019]
module.rds.aws_security_group_rule.in_ssh: Refreshing state... [id=sgrule-1848129182]
module.ecr-app.aws_vpc_endpoint.ecr_api: Refreshing state... [id=vpce-0aa2aa645cd78c54a]
module.ecr-app.aws_vpc_endpoint.cloudwatch_logs: Refreshing state... [id=vpce-0d26e22adef0a927d]
module.rds.aws_network_interface.private_interface_debug[2]: Refreshing state... [id=eni-0e3f9626bfdfb0031]
module.rds.aws_network_interface.private_interface_debug: Refreshing state... [id=eni-08683dfc91c0d3aba]
module.rds.aws_network_interface.private_interface_debug[1]: Refreshing state... [id=eni-05ad5dc06ba188313]
module.ecr-app.aws_vpc_endpoint.ecr_dkr: Refreshing state... [id=vpce-060745b09df69e96a]
module.ecr-app.aws_vpc_endpoint.cloudwatch: Refreshing state... [id=vpce-0aada49a067e44d0b]
module.ecr-app.aws_vpc_endpoint.ssm: Refreshing state... [id=vpce-0685661311e6eb46b]
module.alb.aws_lb.this: Refreshing state... [id=arn:aws:elasticloadbalancing:ap-northeast-1:554506578892:loadbalancer/app/line-bot-sample2/2d23d36ec59ecb9b]
module.rds.aws_vpc_endpoint.rds: Refreshing state... [id=vpce-08152a4039ea057bd]
module.rds.aws_db_subnet_group.this: Refreshing state... [id=linebot-sample2-rds-mysql]
module.rds.aws_nat_gateway.this: Refreshing state... [id=nat-0fba42ac9e86ee322]
module.rds.aws_network_interface.public_interface_debug[1]: Refreshing state... [id=eni-00b962bf3c1f5740f]
module.rds.aws_network_interface.public_interface_debug: Refreshing state... [id=eni-0391a772d38b766d9]
module.rds.aws_network_interface.public_interface_debug[2]: Refreshing state... [id=eni-05aed1eef558c0319]
module.rds.aws_route_table_association.private_1a: Refreshing state... [id=rtbassoc-0af629fe554d7d05a]
module.ecr-app.aws_vpc_endpoint_route_table_association.private_s3[0]: Refreshing state... [id=a-vpce-05f06bcd8be5135ea3530383921]
module.ecr-app.aws_vpc_endpoint_route_table_association.private_s3[1]: Refreshing state... [id=a-vpce-05f06bcd8be5135ea46037175]
module.ecr-app.aws_vpc_endpoint_route_table_association.private_s3[2]: Refreshing state... [id=a-vpce-05f06bcd8be5135ea2941716146]
module.rds.aws_network_interface.handson_private_interface_debug: Refreshing state... [id=eni-00455b167288e2d4b]
module.rds.aws_route.public: Refreshing state... [id=r-rtb-03ce25fc83446e2b61080289494]
module.rds.aws_nat_gateway.nat_1a: Refreshing state... [id=nat-0c60c77c9c7919e8d]
module.rds.aws_route_table_association.public_1a: Refreshing state... [id=rtbassoc-0a568ace33311aea7]
module.rds.aws_network_interface.handson_public_interface_debug: Refreshing state... [id=eni-0663440ef6a8658a7]
module.rds.aws_route.privates: Refreshing state... [id=r-rtb-0b7249501f7f39f801080289494]
module.rds.aws_instance.private: Refreshing state... [id=i-0028c774b3c2bd5c9]
module.rds.aws_instance.private[1]: Refreshing state... [id=i-0e96a2b183929556b]
module.rds.aws_instance.private[2]: Refreshing state... [id=i-0cc31f16e15aded89]
module.rds.aws_instance.public: Refreshing state... [id=i-0470032d0ec6e4245]
module.rds.aws_instance.public[1]: Refreshing state... [id=i-0a0de591375e97875]
module.rds.aws_instance.public[2]: Refreshing state... [id=i-002d7a3307136ce02]
module.rds.aws_rds_cluster.this: Refreshing state... [id=linebot-sample2-rds-mysql]
module.rds.aws_instance.handson_private: Refreshing state... [id=i-0be2b216c13b754ab]
module.rds.aws_route.private_1a: Refreshing state... [id=r-rtb-01d8342ff72d3f71b1080289494]
module.alb.aws_lb_listener.https: Refreshing state... [id=arn:aws:elasticloadbalancing:ap-northeast-1:554506578892:listener/app/line-bot-sample2/2d23d36ec59ecb9b/f629bb67277bf261]
module.alb.aws_lb_listener.http_to_https: Refreshing state... [id=arn:aws:elasticloadbalancing:ap-northeast-1:554506578892:listener/app/line-bot-sample2/2d23d36ec59ecb9b/cb9619fbb54169cb]
module.rds.aws_instance.handson_public: Refreshing state... [id=i-0876d327f5e746b6d]
module.alb.aws_lb_listener_rule.main: Refreshing state... [id=arn:aws:elasticloadbalancing:ap-northeast-1:554506578892:listener-rule/app/line-bot-sample2/2d23d36ec59ecb9b/f629bb67277bf261/d135b6a132b7b048]
module.route53.aws_route53_record.main: Refreshing state... [id=Z04052072YGY8CIREK2A2_line-bot-sample2.moikilo00.net_A]
module.rds.aws_rds_cluster_instance.this: Refreshing state... [id=linebot-sample2-rds-mysql]
module.ecs.aws_ecs_task_definition.main: Refreshing state... [id=line-bot-sample2-task-definition]
module.ecs.aws_ecs_service.main: Refreshing state... [id=arn:aws:ecs:ap-northeast-1:554506578892:service/line-bot-sample2/line-bot-sample2]
module.rds.aws_eip.public_eip[1]: Refreshing state... [id=eipalloc-0e0c42827c2c63ec7]
module.rds.aws_eip.public_eip[2]: Refreshing state... [id=eipalloc-0f6140c2054045d11]
module.rds.aws_eip.public_eip: Refreshing state... [id=eipalloc-0bb5ba653aed59757]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  - destroy
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # module.rds.aws_eip.handson_debug_public_eip will be created
  + resource "aws_eip" "handson_debug_public_eip" {
      + allocation_id        = (known after apply)
      + association_id       = (known after apply)
      + carrier_ip           = (known after apply)
      + customer_owned_ip    = (known after apply)
      + domain               = (known after apply)
      + id                   = (known after apply)
      + instance             = "i-0876d327f5e746b6d"
      + network_border_group = (known after apply)
      + network_interface    = (known after apply)
      + private_dns          = (known after apply)
      + private_ip           = (known after apply)
      + public_dns           = (known after apply)
      + public_ip            = (known after apply)
      + public_ipv4_pool     = (known after apply)
      + tags_all             = (known after apply)
      + vpc                  = true
    }

  # module.rds.aws_eip.public_eip[1] will be destroyed
  - resource "aws_eip" "public_eip" {
      - association_id       = "eipassoc-0b4352f63075bb7ee" -> null
      - domain               = "vpc" -> null
      - id                   = "eipalloc-0e0c42827c2c63ec7" -> null
      - instance             = "i-0a0de591375e97875" -> null
      - network_border_group = "ap-northeast-1" -> null
      - network_interface    = "eni-00b962bf3c1f5740f" -> null
      - private_dns          = "ip-10-0-1-188.ap-northeast-1.compute.internal" -> null
      - private_ip           = "10.0.1.188" -> null
      - public_dns           = "ec2-35-73-233-53.ap-northeast-1.compute.amazonaws.com" -> null
      - public_ip            = "35.73.233.53" -> null
      - public_ipv4_pool     = "amazon" -> null
      - tags                 = {} -> null
      - tags_all             = {} -> null
      - vpc                  = true -> null
    }

  # module.rds.aws_eip.public_eip[2] will be destroyed
  - resource "aws_eip" "public_eip" {
      - association_id       = "eipassoc-04eeaae48f0dd76ce" -> null
      - domain               = "vpc" -> null
      - id                   = "eipalloc-0f6140c2054045d11" -> null
      - instance             = "i-002d7a3307136ce02" -> null
      - network_border_group = "ap-northeast-1" -> null
      - network_interface    = "eni-05aed1eef558c0319" -> null
      - private_dns          = "ip-10-0-2-42.ap-northeast-1.compute.internal" -> null
      - private_ip           = "10.0.2.42" -> null
      - public_dns           = "ec2-54-249-240-70.ap-northeast-1.compute.amazonaws.com" -> null
      - public_ip            = "54.249.240.70" -> null
      - public_ipv4_pool     = "amazon" -> null
      - tags                 = {} -> null
      - tags_all             = {} -> null
      - vpc                  = true -> null
    }

  # module.rds.aws_instance.private must be replaced
-/+ resource "aws_instance" "private" {
      ~ arn                                  = "arn:aws:ec2:ap-northeast-1:554506578892:instance/i-0028c774b3c2bd5c9" -> (known after apply)
      ~ associate_public_ip_address          = true -> (known after apply)
      ~ availability_zone                    = "ap-northeast-1c" -> (known after apply)
      ~ cpu_core_count                       = 1 -> (known after apply)
      ~ cpu_threads_per_core                 = 1 -> (known after apply)
      - disable_api_termination              = false -> null
      - ebs_optimized                        = false -> null
      - hibernation                          = false -> null
      + host_id                              = (known after apply)
      ~ id                                   = "i-0028c774b3c2bd5c9" -> (known after apply)
      ~ instance_initiated_shutdown_behavior = "stop" -> (known after apply)
      ~ instance_state                       = "running" -> (known after apply)
      ~ ipv6_address_count                   = 0 -> (known after apply)
      ~ ipv6_addresses                       = [] -> (known after apply)
      - monitoring                           = false -> null
      + outpost_arn                          = (known after apply)
      + password_data                        = (known after apply)
      + placement_group                      = (known after apply)
      ~ primary_network_interface_id         = "eni-03b819cad6fcc301a" -> (known after apply)
      ~ private_dns                          = "ip-172-31-6-82.ap-northeast-1.compute.internal" -> (known after apply)
      ~ private_ip                           = "172.31.6.82" -> (known after apply)
      ~ public_dns                           = "ec2-54-95-11-209.ap-northeast-1.compute.amazonaws.com" -> (known after apply)
      ~ public_ip                            = "54.95.11.209" -> (known after apply)
      ~ secondary_private_ips                = [] -> (known after apply)
      ~ security_groups                      = [
          - "default",
        ] -> (known after apply)
      - source_dest_check                    = true -> null
      ~ subnet_id                            = "subnet-8d292ad6" -> (known after apply)
        tags                                 = {
            "Name" = "LINE-private-0"
        }
      ~ tenancy                              = "default" -> (known after apply)
      ~ vpc_security_group_ids               = [
          - "sg-e93ee8a0",
        ] -> (known after apply)
        # (5 unchanged attributes hidden)


      + ebs_block_device {
          + delete_on_termination = (known after apply)
          + device_name           = (known after apply)
          + encrypted             = (known after apply)
          + iops                  = (known after apply)
          + kms_key_id            = (known after apply)
          + snapshot_id           = (known after apply)
          + tags                  = (known after apply)
          + throughput            = (known after apply)
          + volume_id             = (known after apply)
          + volume_size           = (known after apply)
          + volume_type           = (known after apply)
        }

      ~ enclave_options {
          ~ enabled = false -> (known after apply)
        }

      + ephemeral_block_device {
          + device_name  = (known after apply)
          + no_device    = (known after apply)
          + virtual_name = (known after apply)
        }

      ~ metadata_options {
          ~ http_endpoint               = "enabled" -> (known after apply)
          ~ http_put_response_hop_limit = 1 -> (known after apply)
          ~ http_tokens                 = "optional" -> (known after apply)
        }

      + network_interface { # forces replacement
          + delete_on_termination = false
          + device_index          = 0
          + network_interface_id  = "eni-08683dfc91c0d3aba"
        }

      ~ root_block_device {
          ~ delete_on_termination = true -> (known after apply)
          ~ device_name           = "/dev/xvda" -> (known after apply)
          ~ encrypted             = false -> (known after apply)
          ~ iops                  = 100 -> (known after apply)
          + kms_key_id            = (known after apply)
          ~ tags                  = {} -> (known after apply)
          ~ throughput            = 0 -> (known after apply)
          ~ volume_id             = "vol-0710e9e75d41128f6" -> (known after apply)
          ~ volume_size           = 8 -> (known after apply)
          ~ volume_type           = "gp2" -> (known after apply)
        }
        # (1 unchanged block hidden)
    }

  # module.rds.aws_instance.private[1] will be destroyed
  - resource "aws_instance" "private" {
      - ami                                  = "ami-0f037327d64de9e49" -> null
      - arn                                  = "arn:aws:ec2:ap-northeast-1:554506578892:instance/i-0e96a2b183929556b" -> null
      - associate_public_ip_address          = true -> null
      - availability_zone                    = "ap-northeast-1c" -> null
      - cpu_core_count                       = 1 -> null
      - cpu_threads_per_core                 = 1 -> null
      - disable_api_termination              = false -> null
      - ebs_optimized                        = false -> null
      - get_password_data                    = false -> null
      - hibernation                          = false -> null
      - id                                   = "i-0e96a2b183929556b" -> null
      - instance_initiated_shutdown_behavior = "stop" -> null
      - instance_state                       = "running" -> null
      - instance_type                        = "t2.micro" -> null
      - ipv6_address_count                   = 0 -> null
      - ipv6_addresses                       = [] -> null
      - key_name                             = "mmm2" -> null
      - monitoring                           = false -> null
      - primary_network_interface_id         = "eni-09cac4c9be8b81057" -> null
      - private_dns                          = "ip-172-31-1-110.ap-northeast-1.compute.internal" -> null
      - private_ip                           = "172.31.1.110" -> null
      - public_dns                           = "ec2-18-183-112-204.ap-northeast-1.compute.amazonaws.com" -> null
      - public_ip                            = "18.183.112.204" -> null
      - secondary_private_ips                = [] -> null
      - security_groups                      = [
          - "default",
        ] -> null
      - source_dest_check                    = true -> null
      - subnet_id                            = "subnet-8d292ad6" -> null
      - tags                                 = {
          - "Name" = "LINE-private-1"
        } -> null
      - tags_all                             = {
          - "Name" = "LINE-private-1"
        } -> null
      - tenancy                              = "default" -> null
      - vpc_security_group_ids               = [
          - "sg-e93ee8a0",
        ] -> null

      - credit_specification {
          - cpu_credits = "unlimited" -> null
        }

      - enclave_options {
          - enabled = false -> null
        }

      - metadata_options {
          - http_endpoint               = "enabled" -> null
          - http_put_response_hop_limit = 1 -> null
          - http_tokens                 = "optional" -> null
        }

      - root_block_device {
          - delete_on_termination = true -> null
          - device_name           = "/dev/xvda" -> null
          - encrypted             = false -> null
          - iops                  = 100 -> null
          - tags                  = {} -> null
          - throughput            = 0 -> null
          - volume_id             = "vol-05e6c87a01198148a" -> null
          - volume_size           = 8 -> null
          - volume_type           = "gp2" -> null
        }
    }

  # module.rds.aws_instance.private[2] will be destroyed
  - resource "aws_instance" "private" {
      - ami                                  = "ami-0f037327d64de9e49" -> null
      - arn                                  = "arn:aws:ec2:ap-northeast-1:554506578892:instance/i-0cc31f16e15aded89" -> null
      - associate_public_ip_address          = true -> null
      - availability_zone                    = "ap-northeast-1c" -> null
      - cpu_core_count                       = 1 -> null
      - cpu_threads_per_core                 = 1 -> null
      - disable_api_termination              = false -> null
      - ebs_optimized                        = false -> null
      - get_password_data                    = false -> null
      - hibernation                          = false -> null
      - id                                   = "i-0cc31f16e15aded89" -> null
      - instance_initiated_shutdown_behavior = "stop" -> null
      - instance_state                       = "running" -> null
      - instance_type                        = "t2.micro" -> null
      - ipv6_address_count                   = 0 -> null
      - ipv6_addresses                       = [] -> null
      - key_name                             = "mmm2" -> null
      - monitoring                           = false -> null
      - primary_network_interface_id         = "eni-05be2ab53dbbb95b1" -> null
      - private_dns                          = "ip-172-31-1-26.ap-northeast-1.compute.internal" -> null
      - private_ip                           = "172.31.1.26" -> null
      - public_dns                           = "ec2-18-183-9-218.ap-northeast-1.compute.amazonaws.com" -> null
      - public_ip                            = "18.183.9.218" -> null
      - secondary_private_ips                = [] -> null
      - security_groups                      = [
          - "default",
        ] -> null
      - source_dest_check                    = true -> null
      - subnet_id                            = "subnet-8d292ad6" -> null
      - tags                                 = {
          - "Name" = "LINE-private-2"
        } -> null
      - tags_all                             = {
          - "Name" = "LINE-private-2"
        } -> null
      - tenancy                              = "default" -> null
      - vpc_security_group_ids               = [
          - "sg-e93ee8a0",
        ] -> null

      - credit_specification {
          - cpu_credits = "unlimited" -> null
        }

      - enclave_options {
          - enabled = false -> null
        }

      - metadata_options {
          - http_endpoint               = "enabled" -> null
          - http_put_response_hop_limit = 1 -> null
          - http_tokens                 = "optional" -> null
        }

      - root_block_device {
          - delete_on_termination = true -> null
          - device_name           = "/dev/xvda" -> null
          - encrypted             = false -> null
          - iops                  = 100 -> null
          - tags                  = {} -> null
          - throughput            = 0 -> null
          - volume_id             = "vol-0499be1de310d51a8" -> null
          - volume_size           = 8 -> null
          - volume_type           = "gp2" -> null
        }
    }

  # module.rds.aws_instance.public[1] will be destroyed
  - resource "aws_instance" "public" {
      - ami                                  = "ami-0f037327d64de9e49" -> null
      - arn                                  = "arn:aws:ec2:ap-northeast-1:554506578892:instance/i-0a0de591375e97875" -> null
      - associate_public_ip_address          = true -> null
      - availability_zone                    = "ap-northeast-1c" -> null
      - cpu_core_count                       = 1 -> null
      - cpu_threads_per_core                 = 1 -> null
      - disable_api_termination              = false -> null
      - ebs_optimized                        = false -> null
      - get_password_data                    = false -> null
      - hibernation                          = false -> null
      - id                                   = "i-0a0de591375e97875" -> null
      - instance_initiated_shutdown_behavior = "stop" -> null
      - instance_state                       = "running" -> null
      - instance_type                        = "t2.micro" -> null
      - ipv6_address_count                   = 0 -> null
      - ipv6_addresses                       = [] -> null
      - key_name                             = "mmm2" -> null
      - monitoring                           = false -> null
      - primary_network_interface_id         = "eni-00b962bf3c1f5740f" -> null
      - private_dns                          = "ip-10-0-1-188.ap-northeast-1.compute.internal" -> null
      - private_ip                           = "10.0.1.188" -> null
      - public_dns                           = "ec2-35-73-233-53.ap-northeast-1.compute.amazonaws.com" -> null
      - public_ip                            = "35.73.233.53" -> null
      - secondary_private_ips                = [] -> null
      - security_groups                      = [] -> null
      - source_dest_check                    = true -> null
      - subnet_id                            = "subnet-0a3c585bbf6bba58b" -> null
      - tags                                 = {
          - "Name" = "LINE-public-bastiation-1"
        } -> null
      - tags_all                             = {
          - "Name" = "LINE-public-bastiation-1"
        } -> null
      - tenancy                              = "default" -> null
      - vpc_security_group_ids               = [
          - "sg-06bdc7be2c94a7cf0",
          - "sg-0ca95d51ffe6d8894",
        ] -> null

      - credit_specification {
          - cpu_credits = "unlimited" -> null
        }

      - enclave_options {
          - enabled = false -> null
        }

      - metadata_options {
          - http_endpoint               = "enabled" -> null
          - http_put_response_hop_limit = 1 -> null
          - http_tokens                 = "optional" -> null
        }

      - network_interface {
          - delete_on_termination = false -> null
          - device_index          = 0 -> null
          - network_interface_id  = "eni-00b962bf3c1f5740f" -> null
        }

      - root_block_device {
          - delete_on_termination = true -> null
          - device_name           = "/dev/xvda" -> null
          - encrypted             = false -> null
          - iops                  = 100 -> null
          - tags                  = {} -> null
          - throughput            = 0 -> null
          - volume_id             = "vol-07798160fb4111dc7" -> null
          - volume_size           = 8 -> null
          - volume_type           = "gp2" -> null
        }
    }

  # module.rds.aws_instance.public[2] will be destroyed
  - resource "aws_instance" "public" {
      - ami                                  = "ami-0f037327d64de9e49" -> null
      - arn                                  = "arn:aws:ec2:ap-northeast-1:554506578892:instance/i-002d7a3307136ce02" -> null
      - associate_public_ip_address          = true -> null
      - availability_zone                    = "ap-northeast-1d" -> null
      - cpu_core_count                       = 1 -> null
      - cpu_threads_per_core                 = 1 -> null
      - disable_api_termination              = false -> null
      - ebs_optimized                        = false -> null
      - get_password_data                    = false -> null
      - hibernation                          = false -> null
      - id                                   = "i-002d7a3307136ce02" -> null
      - instance_initiated_shutdown_behavior = "stop" -> null
      - instance_state                       = "running" -> null
      - instance_type                        = "t2.micro" -> null
      - ipv6_address_count                   = 0 -> null
      - ipv6_addresses                       = [] -> null
      - key_name                             = "mmm2" -> null
      - monitoring                           = false -> null
      - primary_network_interface_id         = "eni-05aed1eef558c0319" -> null
      - private_dns                          = "ip-10-0-2-42.ap-northeast-1.compute.internal" -> null
      - private_ip                           = "10.0.2.42" -> null
      - public_dns                           = "ec2-54-249-240-70.ap-northeast-1.compute.amazonaws.com" -> null
      - public_ip                            = "54.249.240.70" -> null
      - secondary_private_ips                = [] -> null
      - security_groups                      = [] -> null
      - source_dest_check                    = true -> null
      - subnet_id                            = "subnet-03c288199d18a8e45" -> null
      - tags                                 = {
          - "Name" = "LINE-public-bastiation-2"
        } -> null
      - tags_all                             = {
          - "Name" = "LINE-public-bastiation-2"
        } -> null
      - tenancy                              = "default" -> null
      - vpc_security_group_ids               = [
          - "sg-06bdc7be2c94a7cf0",
          - "sg-0ca95d51ffe6d8894",
        ] -> null

      - credit_specification {
          - cpu_credits = "unlimited" -> null
        }

      - enclave_options {
          - enabled = false -> null
        }

      - metadata_options {
          - http_endpoint               = "enabled" -> null
          - http_put_response_hop_limit = 1 -> null
          - http_tokens                 = "optional" -> null
        }

      - network_interface {
          - delete_on_termination = false -> null
          - device_index          = 0 -> null
          - network_interface_id  = "eni-05aed1eef558c0319" -> null
        }

      - root_block_device {
          - delete_on_termination = true -> null
          - device_name           = "/dev/xvda" -> null
          - encrypted             = false -> null
          - iops                  = 100 -> null
          - tags                  = {} -> null
          - throughput            = 0 -> null
          - volume_id             = "vol-0de1242cfe1f176f0" -> null
          - volume_size           = 8 -> null
          - volume_type           = "gp2" -> null
        }
    }

  # module.rds.aws_network_interface.private_interface_debug[1] will be destroyed
  - resource "aws_network_interface" "private_interface_debug" {
      - id                 = "eni-05ad5dc06ba188313" -> null
      - ipv6_address_count = 0 -> null
      - ipv6_addresses     = [] -> null
      - mac_address        = "0a:28:5e:24:03:85" -> null
      - private_dns_name   = "ip-10-0-11-30.ap-northeast-1.compute.internal" -> null
      - private_ip         = "10.0.11.30" -> null
      - private_ips        = [
          - "10.0.11.30",
        ] -> null
      - private_ips_count  = 0 -> null
      - security_groups    = [
          - "sg-0d5ed516513b6a83c",
        ] -> null
      - source_dest_check  = true -> null
      - subnet_id          = "subnet-071a11b51c485b0b1" -> null
      - tags               = {
          - "Name" = "private_debug_network_interface"
        } -> null
      - tags_all           = {
          - "Name" = "private_debug_network_interface"
        } -> null
    }

  # module.rds.aws_network_interface.private_interface_debug[2] will be destroyed
  - resource "aws_network_interface" "private_interface_debug" {
      - id                 = "eni-0e3f9626bfdfb0031" -> null
      - ipv6_address_count = 0 -> null
      - ipv6_addresses     = [] -> null
      - mac_address        = "0e:9f:ff:de:46:eb" -> null
      - private_dns_name   = "ip-10-0-12-110.ap-northeast-1.compute.internal" -> null
      - private_ip         = "10.0.12.110" -> null
      - private_ips        = [
          - "10.0.12.110",
        ] -> null
      - private_ips_count  = 0 -> null
      - security_groups    = [
          - "sg-0d5ed516513b6a83c",
        ] -> null
      - source_dest_check  = true -> null
      - subnet_id          = "subnet-02c271aaae088ea4b" -> null
      - tags               = {
          - "Name" = "private_debug_network_interface"
        } -> null
      - tags_all           = {
          - "Name" = "private_debug_network_interface"
        } -> null
    }

  # module.rds.aws_network_interface.public_interface_debug[1] will be destroyed
  - resource "aws_network_interface" "public_interface_debug" {
      - id                 = "eni-00b962bf3c1f5740f" -> null
      - ipv6_address_count = 0 -> null
      - ipv6_addresses     = [] -> null
      - mac_address        = "0a:a4:fd:9f:f2:9f" -> null
      - private_dns_name   = "ip-10-0-1-188.ap-northeast-1.compute.internal" -> null
      - private_ip         = "10.0.1.188" -> null
      - private_ips        = [
          - "10.0.1.188",
        ] -> null
      - private_ips_count  = 0 -> null
      - security_groups    = [
          - "sg-06bdc7be2c94a7cf0",
          - "sg-0ca95d51ffe6d8894",
        ] -> null
      - source_dest_check  = true -> null
      - subnet_id          = "subnet-0a3c585bbf6bba58b" -> null
      - tags               = {
          - "Name" = "public_debug_network_interface"
        } -> null
      - tags_all           = {
          - "Name" = "public_debug_network_interface"
        } -> null

      - attachment {
          - attachment_id = "eni-attach-00d2e748bbe5d1e78" -> null
          - device_index  = 0 -> null
          - instance      = "i-0a0de591375e97875" -> null
        }
    }

  # module.rds.aws_network_interface.public_interface_debug[2] will be destroyed
  - resource "aws_network_interface" "public_interface_debug" {
      - id                 = "eni-05aed1eef558c0319" -> null
      - ipv6_address_count = 0 -> null
      - ipv6_addresses     = [] -> null
      - mac_address        = "0e:84:e3:a9:9f:6d" -> null
      - private_dns_name   = "ip-10-0-2-42.ap-northeast-1.compute.internal" -> null
      - private_ip         = "10.0.2.42" -> null
      - private_ips        = [
          - "10.0.2.42",
        ] -> null
      - private_ips_count  = 0 -> null
      - security_groups    = [
          - "sg-06bdc7be2c94a7cf0",
          - "sg-0ca95d51ffe6d8894",
        ] -> null
      - source_dest_check  = true -> null
      - subnet_id          = "subnet-03c288199d18a8e45" -> null
      - tags               = {
          - "Name" = "public_debug_network_interface"
        } -> null
      - tags_all           = {
          - "Name" = "public_debug_network_interface"
        } -> null

      - attachment {
          - attachment_id = "eni-attach-0ecf961ce6fd7ca9f" -> null
          - device_index  = 0 -> null
          - instance      = "i-002d7a3307136ce02" -> null
        }
    }

Plan: 2 to add, 0 to change, 11 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>




*Pusher: @lazmond3, Action: `pull_request`*